In [5]:
# import packages
import numpy as np
import pandas as pd
from numpy.random import rand

In [6]:
# Related data objects

# List 
L = [2, 3, 5, 7, 9, 11] 

# Dictionary
D = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000} 

# Structured array
SA = np.array([('Rex', 9, 81.0), ('Fido', 3, 27.0), ('Alice', 25, 55.0), ('Bob', 45, 85.5),
              ('Cathy', 37, 68.0), ('Doug', 19, 61.5)],
             dtype=[('name', 'U10'), ('age', 'i4'), ('weight', 'f4')]) 

# Two-dsimensional NumPy array
rand = np.random.RandomState(42)
TDA = rand.randint(20,100,(4,2)) 

# NumPy array
ND = np.array([[21],
[23],
[24],
[21]])


# Series
PS = pd.Series([59, 35, 69, 23], index=["a", "b", "c", "d"])

# Q1: Contrcuting pandas dataframe objects from a list
  ##  a. print list L 
  ##  b. transfer list L to pandas series SL

In [7]:
# a.
L = ... # List 
print(L)
print(type(L))

Ellipsis
<class 'ellipsis'>

In [8]:
# b.

SL = ...
print(SL)
print(type(SL))

Ellipsis
<class 'ellipsis'>

# Q2: Constructing pandas dataframe objects from a dictionary
## a. print dictionary D
## b. transfer dictionary D to pandas series SD
## c. add new data {"California": "45000"} to SD
## d. print a pandas series by selecting entries from "Ohio" to "Oregon"

In [9]:
# a.
D = ... # Dictionary
print(D)

Ellipsis

In [10]:
# b.

SD = ...
print(SD)
print(type(SD))

Ellipsis
<class 'ellipsis'>

In [11]:
# c.

...
print(SD)

Ellipsis

In [12]:
# d.

print(SD[...])

TypeError: 'ellipsis' object is not subscriptable

# Q3: Constructing pandas dataframe objects from a numpy structured array
## a. print SA
## b. transfer numpy structured array SA to pandas dataframe DF

In [13]:
SA = np.array(...) # Structured array

print(SA)

Ellipsis

In [14]:
DF = ...
print(DF)

Ellipsis

# Q4: Constructing pandas dataframe objects from a two-dimensional numpy array
## a. print TDA
## b. transfer numpy array TDA to pandas dataframe df2, and
## i. set column name as "foo" and "bar"
## ii. set index as ["a", "b", "c", "d"]
## c. append new column ND to df2, and set column name as "age"

In [15]:
# a.

rand = np.random.RandomState(42)
TDA = ...
print(TDA)
print(type(TDA))

Ellipsis
<class 'ellipsis'>

In [16]:
# b.

df2 = ...
print(df2)

Ellipsis

In [17]:
# b. i. ii.

df2 = pd.DataFrame(..., 
                   columns=...,
                  index=...)
print(df2)

TypeError: 'ellipsis' object is not iterable

In [ ]:
ND = np.array([[21],
[23],
[24],
[21]])

print(ND)

In [ ]:
# c. 

...
print(df2)

# Q5: Select data by index in pandas series
## a. print PS
## b. select the data in PS by index "a" to "b"
## c. select the data in PS by 2 to 3 rows
## d. select the data in PS by fancy index "a" and "c"
## e. select the data in PS by the mask (E1 > 30) & (E1 < 60)

In [61]:
# a.

PS = ...
print(PS)

a    59
b    35
c    69
d    23
dtype: int64

In [62]:
# b.

...

a    59
b    35
dtype: int64

In [63]:
# c.

...

c    69
d    23
dtype: int64

In [64]:
# d. 

PS[...]

a    59
c    69
dtype: int64

In [65]:
# e. 

PS[...]

a    59
b    35
dtype: int64

# Q6: Index as ordered set
## a. create pandas index object IO1, ["a", "b", "c", "d"]
## b. create pandas index object IO2, ["a", "c", "e", "g"]
## c. find the intersection of IO1 and IO2
## d. find the union of IO1 and IO2
## e. find the symmetric difference of IO1 and IO2

In [67]:
# a.

IO1 =  ...
print(IO1)

Index(['a', 'b', 'c', 'd'], dtype='object')

In [68]:
# b.

IO2 = ...
print(IO2)

Index(['a', 'c', 'e', 'g'], dtype='object')

In [69]:
# c.

...

Index(['a', 'c'], dtype='object')

In [70]:
# d.

...

Index(['a', 'b', 'c', 'd', 'e', 'g'], dtype='object')

In [71]:
# e.

...

Index(['b', 'd', 'e', 'g'], dtype='object')

# Q7: Indexers: loc and iloc
## a. print df2
## b. select the data in "a" row and "foo" column from df2 by loc
## c. select the data in "a" to "b" rows and "foo" to "bar" columns from df2 by loc
## d. select the data in 0 row and 0 column from df2 by iloc
## e. select the data in 0 to 1 rows and 0 to 1 columns from df2 by iloc
## f. select the data in "a" and "c" rows and "foo" and "age" columns from df2 by iloc or loc

In [72]:
# a.

...

   foo  bar  age
a   71   34   21
b   91   80   23
c   40   94   24
d   94   43   21

In [76]:
# b.

...

71

In [77]:
# c.

...

   foo  bar
a   71   34
b   91   80

In [78]:
# d.

...

71

In [80]:
# e.

...

   foo  bar
a   71   34
b   91   80

In [82]:
# f.

...

   foo  age
a   71   21
c   40   24

# Q8: DataFrame as two-dimensional array
## a. combine below two pandas series, "area" and "population" into pandas DataFrame df3
## b. create new column "density" by "population/area"
## c. swap rows and columns
## d. select columns "population" and "density", where "density"<100

In [3]:
area = pd.Series({'California': 423967, 
             'Texas': 695662, 
             'New York': 141297,
             'Florida': 170312, 
             'Illinois': 149995})

In [4]:
population = pd.Series({'California': 38332521,
                    'Texas': 26448193,
                    'New York': 19651127,
                    'Florida': 19552860,
                    'Illinois': 12882135})

In [5]:
# a. 

df3 = pd.DataFrame(...)

print(df3)

              area  population
California  423967    38332521
Texas       695662    26448193
New York    141297    19651127
Florida     170312    19552860
Illinois    149995    12882135

In [7]:
# b.

...

print(df3)

              area  population     density
California  423967    38332521   90.413926
Texas       695662    26448193   38.018740
New York    141297    19651127  139.076746
Florida     170312    19552860  114.806121
Illinois    149995    12882135   85.883763

In [8]:
# c.
# use transpose to swap rows and columns

...

,California,Texas,New York,Florida,Illinois
area,4.239670e+05,6.956620e+05,1.412970e+05,1.703120e+05,1.499950e+05
population,3.833252e+07,2.644819e+07,1.965113e+07,1.955286e+07,1.288214e+07
density,9.041393e+01,3.801874e+01,1.390767e+02,1.148061e+02,8.588376e+01

In [12]:
df3

              area  population     density
California  423967    38332521   90.413926
Texas       695662    26448193   38.018740
New York    141297    19651127  139.076746
Florida     170312    19552860  114.806121
Illinois    149995    12882135   85.883763

In [23]:
# d.

...

            population    density
California    38332521  90.413926
Texas         26448193  38.018740
Illinois      12882135  85.883763

# Q9: Index Alignment in Series
## a. add IS1 and IS2
## b. add IS1 and IS2, fill 0 if any elements in A or B are missing

In [35]:
# run before you answer

IS1 = pd.Series([2, 4, 6, 8,10], index=[0, 1, 2, 3, 4])
IS2 = pd.Series([1, 3, 5, 7,9], index=[1, 2, 3, 4, 5])

In [37]:
# a.

...

0     NaN
1     5.0
2     9.0
3    13.0
4    17.0
5     NaN
dtype: float64

In [38]:
...

0     2.0
1     5.0
2     9.0
3    13.0
4    17.0
5     9.0
dtype: float64

# Q10: Index Alignment in DataFrame
## a. add IS3 and IS4
## b. add IS3 and IS4, fill mean value of IS3 or IS4 DataFrame if any elements in A or B are missing respectively.

In [39]:
IS3 = pd.DataFrame([[1, 2],[3, 4]], columns=list('AB'))
IS4 = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]], columns=list('BAC'))

In [40]:
print(IS3)
print(IS4)

   A  B
0  1  2
1  3  4
   B  A  C
0  1  2  3
1  4  5  6
2  7  8  9

In [41]:
# a. 

...

     A    B   C
0  3.0  3.0 NaN
1  8.0  8.0 NaN
2  NaN  NaN NaN

In [20]:
IS3.stack().mean()

NameError: name 'IS3' is not defined

In [44]:
# b.

...

      A    B     C
0   3.0  3.0   5.5
1   8.0  8.0   8.5
2  10.5  9.5  11.5